# Brewfile - Full installation
# Updated: December 2025
# Note: Removed deprecated homebrew/dupes, homebrew/science, homebrew/versions taps
# Note: Removed deprecated 'args: with-*' syntax (Homebrew no longer supports these)

# =============================================================================
# Core utilities
# =============================================================================
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnu-indent'
brew 'gawk'

# Shell
brew 'bash'
brew 'zsh'

# =============================================================================
# Version control & Git
# =============================================================================
brew 'git'
brew 'git-crypt'
brew 'hub'
brew 'tig'
brew 'bfg'

# =============================================================================
# Build tools & compilers
# =============================================================================
brew 'autoconf'
brew 'autoconf-archive'
brew 'automake'
brew 'cmake'
brew 'gcc'
brew 'libtool'
brew 'pkg-config'

# =============================================================================
# Languages & runtimes
# =============================================================================
brew 'python'
brew 'python3'
brew 'go'
brew 'ruby'
brew 'ruby-install'
brew 'chruby'
brew 'node'
brew 'rust'
brew 'perl'
brew 'lua'
brew 'luajit'

# =============================================================================
# Security & encryption
# =============================================================================
brew 'gnupg'
brew 'openssl'
brew 'pinentry'
brew 'libyubikey'
brew 'ykpers'

# =============================================================================
# Networking & web
# =============================================================================
brew 'curl'
brew 'wget'
brew 'autossh'
brew 'nmap'
brew 'httpie'
brew 'links'
brew 'w3m'

# =============================================================================
# Search & navigation
# =============================================================================
brew 'ack'
brew 'the_silver_searcher'
brew 'tree'
brew 'pstree'
brew 'htop'
brew 'peco'

# =============================================================================
# Cloud & infrastructure
# =============================================================================
brew 'awscli'
brew 's3cmd'
brew 'rclone'
brew 'terraform'

# =============================================================================
# Text processing & editing
# =============================================================================
brew 'jq'
brew 'pandoc'
brew 'ispell'
brew 'ctags'

# =============================================================================
# Media & graphics
# =============================================================================
brew 'ffmpeg'
brew 'imagemagick'
brew 'graphviz'

# =============================================================================
# Email & communication
# =============================================================================
brew 'msmtp'
brew 'isync'
brew 'mutt'
brew 'mu'
brew 'notmuch'
brew 'weechat'
brew 'halloy'  # modern IRC client

# =============================================================================
# Terminal & multiplexing
# =============================================================================
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'terminal-notifier'

# =============================================================================
# Development utilities
# =============================================================================
brew 'direnv'
brew 'entr'
brew 'watch'

# =============================================================================
# Archiving & compression
# =============================================================================
brew 'unar'
brew 'unrar'
brew 'xz'
brew 'p7zip'
brew 'lzip'

# =============================================================================
# Libraries (dependencies, may auto-install)
# =============================================================================
brew 'readline'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'binutils'
brew 'sqlite'
brew 'libyaml'
brew 'libxml2'
brew 'pcre'
brew 'oniguruma'

# =============================================================================
# DNS & networking tools
# =============================================================================
brew 'dnsmasq'
brew 'proxychains-ng'

# =============================================================================
# Backup
# =============================================================================
brew 'borgbackup'

# =============================================================================
# Password management
# =============================================================================
brew 'gopass'

# =============================================================================
# Casks (GUI applications)
# =============================================================================
cask 'docker'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'libreoffice'
cask 'spotify'
cask 'transmission'
cask 'vlc'
cask 'wireshark'

# Optional casks (uncomment if needed)
# cask 'vagrant'
# cask 'virtualbox'
# cask 'electrum'
# cask 'rstudio'
cask 'openscad'
cask 'yed'
cask 'grandperspective'
cask 'airflow'
