# Brewfile - Casks only (CLI tools managed by Nix)
# Run: brewsync (or brew bundle --file=~/dotfiles/Brewfile)

tap "tw93/tap"

# =============================================================================
# Brews (only those not available/working well in Nix)
# =============================================================================
brew "mole"  # tw93/tap

# =============================================================================
# Casks (GUI applications)
# =============================================================================
cask "airflow"
cask "audacity"
cask "balenaetcher"
cask "blender"
cask "darktable"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "grandperspective"
cask "openscad"
cask "orbstack"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "transmission"
cask "vlc"
cask "yed"

# Optional (uncomment if needed)
# cask "docker"
# cask "google-drive"
# cask "libreoffice"
# cask "wireshark"
